Elizabeth/trunk/app/controllers/albums_controller.rb

SELECT * FROM `albums`
---
  def index
    @albums = Album.all

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
SELECT * FROM `photos` WHERE (album_id like '1') ORDER BY id LIMIT 0, 16
SELECT count(*) AS count_all FROM `photos` WHERE (`photos`.album_id = 1)
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
SELECT * FROM `events` WHERE (album_id = '1') LIMIT 1
---
  def show
    @album = Album.find(params[:id])
#    @photos = @album.photos

    @photos = Photo.search(params[:id],params[:page])

    @organization = Organization.find(:first, :conditions => ["album_id = ?",params[:id]])
    @event = Event.find(:first, :conditions => ["album_id = ?",params[:id]])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
SELECT count(*) AS count_all FROM `photos` WHERE (`photos`.album_id = 1)
SELECT * FROM `photos` WHERE (`photos`.album_id = 1)
---
  def edit
    @album = Album.find(params[:id])
    if @album.photos.count < 3
      1.upto(3 - @album.photos.count) { @album.photos.build }