Elizabeth/trunk/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`name`, `event_id`, `updated_at`, `picture_id`, `comment`, `created_at`) VALUES('Cheecho', 1, '2009-11-15 21:35:22', NULL, 'Comment 1', '2009-11-15 21:35:22')