Elizabeth/trunk/app/controllers/events_controller.rb

  def index
    if !(params[:id] == nil)
      @events = Event.find(:all, :conditions =>  ["org_id = ?", params[:id]], :order => "created_at")
    else
      #if logged_in?
      #  @owner = current_user.has_role? ('owner', event)
      #end
      @events = Event.all
---
SELECT * FROM `events` WHERE (org_id = '12') ORDER BY created_at
SELECT * FROM `events`

  def show
    @event = Event.find(params[:id])
    @comment = Comment.new
    @comments = Comment.find(:all, :conditions =>  ["event_id = ?", @event.id], :order => "created_at")
    @album = Album.find_by_id(@event.album_id)
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)
SELECT * FROM `comments` WHERE (event_id = 1) ORDER BY created_at
SELECT * FROM `albums` WHERE (`albums`.`id` IS NULL) LIMIT 1

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)

  def create
    @event = Event.new(params[:event])

    @album = Album.new
    @album.name = @event.name
    @album.save
---
INSERT INTO `albums` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2009-11-29 04:50:00', NULL, '2009-11-29 04:50:00')
INSERT INTO `events` (`name`, `end_at`, `is_multi_day`, `updated_at`, `org_id`, `priority`, `album_id`, `location_id`, `start_at`, `is_active`, `description`, `category_id`, `created_at`) VALUES('hihi', '2009-11-27 19:09:00', 0, '2009-11-27 19:09:51', 1, 0, NULL, 1, '2009-11-27 19:09:00', 1, 'hi', 1, '2009-11-27 19:09:51')

  def update
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 3)