Elizabeth/trunk/app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT * FROM `organizations`

  def show
    @organization = Organization.find(params[:id])
    @events = Event.find(:all, :conditions =>  ["org_id = ? and is_active = ?", @organization.id, true])
    @album = Album.find_by_id(@organization.album_id)
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
SELECT * FROM `events` WHERE (org_id = 1 and is_active = 1)
SELECT * FROM `albums` WHERE (`albums`.`id` IS NULL) LIMIT 1

  def edit
    @organization = Organization.find(params[:id])
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)

  def create
    @organization = Organization.new(params[:organization])

    @album = Album.new
    @album.name = @organization.name
    @album.save
---
INSERT INTO `albums` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2009-11-29 05:01:46', NULL, '2009-11-29 05:01:46')
INSERT INTO `organizations` (`name`, `updated_at`, `is_pending`, `username`, `album_id`, `location_id`, `website`, `cellphone`, `is_active`, `description`, `category_id`, `phone`, `fax`, `user_type`, `user_id`, `password`, `email`, `created_at`) VALUES('Eli test', '2009-11-27 18:30:01', 0, 'test', NULL, NULL, '', '11', 1, 'g0', 1, '11', '11', 'Community Organization', 2, 'test', 'go', '2009-11-27 18:30:01')

  def update
    @organization = Organization.find(params[:id])

    if current_user.has_role?('admin')
      @organization.is_pending = false
    end
    respond_to do |format|
      if @organization.update_attributes(params[:organization])
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
UPDATE `organizations` SET `created_at` = '2009-11-27 23:05:21', `phone` = 'qwe', `fax` = '', `username` = 'test', `album_id` = NULL, `category_id` = 1, `location_id` = NULL, `is_active` = 1, `user_id` = 14, `user_type` = 'Community Organization', `email` = 'qwe', `description` = 'yay org', `is_pending` = 0, `password` = 'test', `website` = '', `cellphone` = '', `updated_at` = '2009-11-27 23:08:21', `name` = 'user9\'s org' WHERE `id` = 14

  def destroy
    @organization = Organization.find(params[:id])

    if current_user.has_role?('org')
      @organization.is_active = false
      @organization.update_attributes(params[:organization])
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 2)
UPDATE `organizations` SET `created_at` = '2009-11-03 21:58:01', `phone` = NULL, `fax` = NULL, `username` = NULL, `category_id` = 1, `location_id` = NULL, `is_active` = 0, `user_type` = NULL, `email` = NULL, `description` = NULL, `is_pending` = 0, `password` = NULL, `website` = NULL, `cellphone` = NULL, `updated_at` = '2009-11-23 07:04:01', `name` = 'Elizabeth High School' WHERE `id` = 2