Elizabeth/trunk/app/controllers/photos_controller.rb

SELECT * FROM `photos` WHERE (`photos`.`id` = 32)
SELECT * FROM `albums` WHERE (`albums`.`id` = 1) LIMIT 1
---
  def show
    @photo = Photo.find(params[:id])
    @album = Album.find_by_id(@photo.album_id)